Sasha7b9Work/USKD/sources/common/_VS_LIBS/GD32F3/gd32f30x_adc.cpp
// 2023/04/13 15:40:10 (c) Aleksandr Shevchenko e-mail : Sasha7b9@tut.by
#include <gd32f30x.h>


void adc_interrupt_flag_clear(uint32_t adc_periph, uint32_t adc_interrupt)
{

}


void adc_interrupt_enable(uint32_t adc_periph, uint32_t adc_interrupt)
{

}


void adc_software_trigger_enable(uint32_t adc_periph, uint8_t adc_channel_group)
{

}


void adc_external_trigger_source_config(uint32_t adc_periph, uint8_t adc_channel_group, uint32_t external_trigger_source)
{

}


void adc_external_trigger_config(uint32_t adc_periph, uint8_t adc_channel_group, ControlStatus newvalue)
{

}


void adc_regular_channel_config(uint32_t adc_periph, uint8_t rank, uint8_t adc_channel, uint32_t sample_time)
{

}


void adc_channel_length_config(uint32_t adc_periph, uint8_t adc_channel_group, uint32_t length)
{

}


void adc_data_alignment_config(uint32_t adc_periph, uint32_t data_alignment)
{

}


void adc_special_function_config(uint32_t adc_periph, uint32_t function, ControlStatus newvalue)
{

}


void adc_mode_config(uint32_t mode)
{

}


void adc_dma_mode_enable(uint32_t adc_periph)
{

}


void adc_calibration_enable(uint32_t adc_periph)
{

}


void adc_enable(uint32_t adc_periph)
{

}
